# 7.	Создать список с числами от 1 до 50 используя генератор списков.

a = 0
mas = []

while a < 50:
    a += 1
    mas.append(a)
print(mas)