
# 5.	Создайте словарь из строки ' An apple a day keeps the doctor away'    следующим образом:
# в качестве ключей возьмите символы строки, а значениями пусть будут числа,
# соответствующие количеству вхождений данной буквы в строку.

# my_dict = "An apple a day keeps the doctor away"
# my_dict0 = my_dict.replace(' ','')
# my_dict1 = {i:my_dict0.count(i) for i in my_dict0}
# print(my_dict1)


