
# 4.	Создайте 2 множества:
# - Если они одинаковые: вывести что они равны
# - Если 1 множество полностью состоит из второго: вывести сообщение множество 1
# состоит из множества2
# - Если 2 множество полностью состоит из 1: вывести сообщение множество 2
#  	 состоит из множества 1
# - Если они пересекаются: вывести элементы в которых они пересекаются
# - Если не пересекаются: вывести сообщение об этом

# A = set(input('Создайте множество A: '))
# B = set(input('Создайте множество B: '))
# print('множество A: ',A,'\nмножество B: ',B)
# if A == B:
#     print('эти множества равны!')
# if A & B:
#     print('эти множества пересекаются: ',A & B)
#     if A - B:
#         print('множество А состоит из множества В!')
#     if B - A:
#         print('множество В состоит из множества А!')
# else:
#     print('эти множества не пересекаются!')

